betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_flash.c
    status = FLASH_GetStatus();

    while((status == FLASH_BUSY) && (Timeout != 0x00))
    {
        status = FLASH_GetStatus();
        Timeout--;
    }
    if(Timeout == 0x00)
    {
        status = FLASH_TIMEOUT;
    }
    return status;
}

/*********************************************************************
 * @fn      FLASH_Unlock_Fast
 *
 * @brief   Unlocks the Fast Program Erase Mode.
 *
 * @return  none
 */
void FLASH_Unlock_Fast(void)
{
    FLASH->KEYR = FLASH_KEY1;
    FLASH->KEYR = FLASH_KEY2;

    FLASH->MODEKEYR = FLASH_KEY1;
    FLASH->MODEKEYR = FLASH_KEY2;
}

/*********************************************************************
 * @fn      FLASH_Lock_Fast
 *
 * @brief   Locks the Fast Program Erase Mode.
 *
 * @return  none
 */
void FLASH_Lock_Fast(void)
{
    FLASH->CTLR |= CR_FLOCK_Set;
}

/*********************************************************************
 * @fn      FLASH_EraseBlock_32K_Fast
 *
 * @brief   Erases a specified FLASH Block (1Block = 32KByte or 64KByte).
 *        If the flash is Dual flash mode,then block erase size is 64KB.
 *        If the flash is single flash mode,then block erase size is 32KB.
 * @param   Block_Address - The block address to be erased.
 *
 * @return  none
 */
void FLASH_EraseBlock_Fast(uint32_t Block_Address)
{
    if(((*(vu32*)FLASH_CFGR0_BASE) & (1<<28)) != 0)
    {
        Block_Address &= 0xFFFF0000;
    }
    else 
    {
        Block_Address &= 0xFFFF8000;
    }

    FLASH->CTLR |= CR_BER;
    FLASH->ADDR = Block_Address;
    FLASH->CTLR |= CR_STRT_Set;
    while(FLASH->STATR & SR_BSY)
        ;
    FLASH->CTLR &= ~CR_BER;
}

/*********************************************************************
 * @fn      FLASH_ProgramPage_Fast
 *
 * @brief   Program a specified FLASH page (1page = 256Byte).
 *
 * @param   Page_Address - The page address to be programed.
 *
 * @return  none
 */
void FLASH_ProgramPage_Fast(uint32_t Page_Address, uint32_t *pbuf)
{
    uint8_t size = 64;
    __disable_irq( );    //it would be important!

    Page_Address &= 0xFFFFFF00;

    FLASH->CTLR |= CR_PAGE_PG;
    while(FLASH->STATR & SR_BSY)
        ;
    while(FLASH->STATR & SR_WR_BSY)
        ;

    while(size)
    {
        *(uint32_t *)Page_Address = *(uint32_t *)pbuf;
        Page_Address += 4;
        pbuf += 1;
        size -= 1;
#ifdef Core_V5F
        __asm("fence");
#endif
        while(FLASH->STATR & SR_WR_BSY)
            ;
    }

    FLASH->CTLR |= CR_PG_STRT;
    while(FLASH->STATR & SR_BSY)
        ;
    FLASH->CTLR &= ~CR_PAGE_PG;
    
    __enable_irq( );
}

/*********************************************************************
 * @fn      FLASH_Enhance_Mode
 *
 * @brief   Read FLASH Enhance Mode
 *
 * @param   Newstate - new state of the ReadOut Protection(ENABLE or DISABLE).
 *
 * @return  none
 */
void FLASH_Enhance_Mode(FunctionalState NewState)
{
    if(NewState)
    {
        FLASH->ACTLR |= ( 1<< 7);
    }
    else
    {
        FLASH->ACTLR &= ~( 1<< 7);
        FLASH->CTLR |= (1 << 22);
    }
}

/*********************************************************************
 * @fn      FLASH_Access_Clock_Cfg
 *
 * @brief   Config FLASH Access Clock(Need to unlock )
 *
 * @param   FLASH_Access_CLK -
 *            FLASH_CLK_HCLKDIV1 - HCLK clock
 *            FLASH_CLK_HCLKDIV2 - HCLK clock/2
 *            FLASH_CLK_HCLKDIV4 - HCLK clock/4
 *            FLASH_CLK_HCLKDIV8 - HCLK clock/8
 *
 * @return  none
 */
void FLASH_Access_Clock_Cfg(uint32_t FLASH_Access_CLK)
{
    FLASH->ACTLR &= ~FLASH_ACTLR_SCK_CFG;
    FLASH->ACTLR |= FLASH_Access_CLK;
}

/*********************************************************************
 * @fn      FLASH_LP_Cmd
 *
 * @brief   Enables or disables the FLASH enter low power mode.
 *
 * @param   NewState - new state of the FLASH enter low power mode.
 *        (ENABLE or DISABLE).
 *
 * @return  none
 */
void FLASH_LP_Cmd(FunctionalState NewState)
{
    if(NewState)
    {
        FLASH->ACTLR |= FLASH_ACTLR_LP;
    }
    else
    {
        FLASH->ACTLR &= ~FLASH_ACTLR_LP;
    }
}

/*********************************************************************
 * @fn      SystemReset_StartMode
 *
 * @brief   Start mode after system reset.
 *
 * @param   Mode - Start mode.
 *            Start_Mode_USER - USER start after system reset
 *            Start_Mode_BOOT - Boot start after system reset
 *
 * @return  none
 */
void SystemReset_StartMode(uint32_t Mode)
{
    FLASH_Unlock();

    FLASH->BOOT_MODEKEYR = FLASH_KEY1;
    FLASH->BOOT_MODEKEYR = FLASH_KEY2;

    FLASH->STATR &= ~FLASH_STATR_BOOT_MODE;
    if(Mode == Start_Mode_BOOT)
    {
        FLASH->STATR |= FLASH_STATR_BOOT_MODE;
    }

    FLASH_Lock();
}

/*********************************************************************
 * @fn      ROM_ERASE
 *
 * @brief   Select erases a specified FLASH .
 *
 * @param   StartAddr - Erases Flash start address.
 *        If the flash is Dual flash mode - (StartAddr%(8KB) == 0).
 *        If the flash is single flash mode - (StartAddr%(4KB) == 0).
 *          Cnt - Erases count.
 *          Erase_Size - Erases size select.The returned value can be:
 *          Size_64KB, Size_32KB, Size_8KB,Size_4KB
 *
 * @return  none.
 */
static void ROM_ERASE(uint32_t StartAddr, uint32_t Cnt, uint32_t Erase_Size)
{
    do{
        if(Erase_Size == Size_64KB)
        {
            FLASH->CTLR |= CR_BER;
        }
        else if(Erase_Size == Size_32KB)
        {
            FLASH->CTLR |= CR_BER;
        }
        else if(Erase_Size == Size_8KB)
        {
            FLASH->CTLR |= CR_PER_Set;
        }
        else if(Erase_Size == Size_4KB)
        {
            FLASH->CTLR |= CR_PER_Set;
        }

        FLASH->ADDR = StartAddr;
        FLASH->CTLR |= CR_STRT_Set;
        while(FLASH->STATR & SR_BSY)
            ;

        if(Erase_Size == Size_64KB)
        {
            FLASH->CTLR &= ~CR_BER;
            StartAddr += Size_64KB;
        }
        else if(Erase_Size == Size_32KB)
        {
            FLASH->CTLR &= ~CR_BER;
            StartAddr += Size_32KB;
        }
        else if(Erase_Size == Size_8KB)
        {
            FLASH->CTLR &= ~CR_PER_Set;
            StartAddr += Size_8KB;
        }
        else if(Erase_Size == Size_4KB)
        {
            FLASH->CTLR &= ~CR_PER_Set;
            StartAddr += Size_4KB;
        }

    }while(--Cnt);
}

/*********************************************************************
 * @fn      FLASH_ROM_ERASE
 *
 * @brief   Erases a specified FLASH .
 *
 * @param   StartAddr - Erases Flash start address.
 *          Length - Erases Flash start Length.
 *        If the flash is Dual flash mode - (StartAddr%(8KB) == 0).
 *        If the flash is single flash mode - (StartAddr%(4KB) == 0).
 *
 * @return  FLASH Status - The returned value can be: FLASH_ADR_RANGE_ERROR,
 *        FLASH_ALIGN_ERROR, FLASH_OP_RANGE_ERROR or FLASH_COMPLETE.
 */
FLASH_Status FLASH_ROM_ERASE(uint32_t StartAddr, uint32_t Length)
{
    uint32_t Addr0 = 0, Addr1 = 0, Length0 = 0, Length1 = 0;

