betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_flash.c
    FLASH_Status status = FLASH_COMPLETE;
    if(((*(vu32*)FLASH_CFGR0_BASE) & (1<<28)) != 0)
    {
        if((StartAddr < ValidAddrStart) || (StartAddr >= ValidAddrEnd_Dual))
        {
            return FLASH_ADR_RANGE_ERROR;
        }

        if((StartAddr + Length) > ValidAddrEnd_Dual)
        {
            return FLASH_OP_RANGE_ERROR;
        }

        if((StartAddr & (Size_8KB-1)) || (Length & (Size_8KB-1)) || (Length == 0))
        {
            return FLASH_ALIGN_ERROR;
        }

        /* Authorize the FPEC of Bank1 Access */
        FLASH->KEYR = FLASH_KEY1;
        FLASH->KEYR = FLASH_KEY2;

        /* Fast mode unlock */
        FLASH->MODEKEYR = FLASH_KEY1;
        FLASH->MODEKEYR = FLASH_KEY2;

        Addr0 = StartAddr;

        if(Length >= Size_64KB)
        {
            Length0 = Size_64KB - (Addr0 & (Size_64KB - 1));
            Addr1 = StartAddr + Length0;
            Length1 = Length - Length0;
        }
        else if(Length >= Size_8KB)
        {
            Length0 = Length;
        }


        /* Erase 64KB */
        if(Length0 >= Size_64KB)//front
        {
            Length = Length0;
            if(Addr0 & (Size_64KB - 1))
            {
                Length0 = Size_64KB - (Addr0 & (Size_64KB - 1));
            }
            else
            {
                Length0 = 0;
            }

            ROM_ERASE((Addr0 + Length0), ((Length - Length0) >> 16), Size_64KB);
        }

        if(Length1 >= Size_64KB)//back
        {
            StartAddr = Addr1;
            Length = Length1;

            if((Addr1 + Length1) & (Size_64KB - 1))
            {
                Addr1 = ((StartAddr + Length1) & (~(Size_64KB - 1)));
                Length1 = (StartAddr + Length1) & (Size_64KB - 1);
            }
            else
            {
                Length1 = 0;
            }

            ROM_ERASE(StartAddr, ((Length - Length1) >> 16), Size_64KB);
        }

        /* Erase 8KB */
        if(Length0)//front
        {
            ROM_ERASE(Addr0, (Length0 >> 13), Size_8KB);
        }

        if(Length1)//back
        {
            ROM_ERASE(Addr1, (Length1 >> 13), Size_8KB);
        }
    }
    else 
    {
        if((StartAddr < ValidAddrStart) || (StartAddr >= ValidAddrEnd_Signal))
        {
            return FLASH_ADR_RANGE_ERROR;
        }

        if((StartAddr + Length) > ValidAddrEnd_Signal)
        {
            return FLASH_OP_RANGE_ERROR;
        }

        if((StartAddr & (Size_4KB-1)) || (Length & (Size_4KB-1)) || (Length == 0))
        {
            return FLASH_ALIGN_ERROR;
        }

        /* Authorize the FPEC of Bank1 Access */
        FLASH->KEYR = FLASH_KEY1;
        FLASH->KEYR = FLASH_KEY2;

        /* Fast mode unlock */
        FLASH->MODEKEYR = FLASH_KEY1;
        FLASH->MODEKEYR = FLASH_KEY2;

        Addr0 = StartAddr;

        if(Length >= Size_32KB)
        {
            Length0 = Size_32KB - (Addr0 & (Size_32KB - 1));
            Addr1 = StartAddr + Length0;
            Length1 = Length - Length0;
        }
        else if(Length >= Size_4KB)
        {
            Length0 = Length;
        }


        /* Erase 32KB */
        if(Length0 >= Size_32KB)//front
        {
            Length = Length0;
            if(Addr0 & (Size_32KB - 1))
            {
                Length0 = Size_32KB - (Addr0 & (Size_32KB - 1));
            }
            else
            {
                Length0 = 0;
            }

            ROM_ERASE((Addr0 + Length0), ((Length - Length0) >> 15), Size_32KB);
        }

        if(Length1 >= Size_32KB)//back
        {
            StartAddr = Addr1;
            Length = Length1;

            if((Addr1 + Length1) & (Size_32KB - 1))
            {
                Addr1 = ((StartAddr + Length1) & (~(Size_32KB - 1)));
                Length1 = (StartAddr + Length1) & (Size_32KB - 1);
            }
            else
            {
                Length1 = 0;
            }

            ROM_ERASE(StartAddr, ((Length - Length1) >> 15), Size_32KB);
        }

        /* Erase 4KB */
        if(Length0)//front
        {
            ROM_ERASE(Addr0, (Length0 >> 12), Size_4KB);
        }

        if(Length1)//back
        {
            ROM_ERASE(Addr1, (Length1 >> 1), Size_4KB);
        }
    }

    FLASH->CTLR |= CR_FLOCK_Set;
    FLASH->CTLR |= CR_LOCK_Set;

    return status;
}

/*********************************************************************
 * @fn      FLASH_ROM_WRITE
 *
 * @brief   Writes a specified FLASH .
 *
 * @param   StartAddr - Writes Flash start address(StartAddr%256 == 0).
 *          Length - Writes Flash start Length(Length%256 == 0).
 *
 *          pbuf - Writes Flash value buffer.
 *
 * @return  FLASH Status - The returned value can be: FLASH_ADR_RANGE_ERROR,
 *        FLASH_ALIGN_ERROR, FLASH_OP_RANGE_ERROR or FLASH_COMPLETE.
 */
FLASH_Status FLASH_ROM_WRITE(uint32_t StartAddr, uint32_t *pbuf, uint32_t Length)
{
    uint32_t i;
    uint8_t size;

    FLASH_Status status = FLASH_COMPLETE;

    if(((*(vu32*)FLASH_CFGR0_BASE) & (1<<28)) != 0)
    {
        if((StartAddr < ValidAddrStart) || (StartAddr >= ValidAddrEnd_Dual))
        {
        return FLASH_ADR_RANGE_ERROR;
        }

        if((StartAddr + Length) > ValidAddrEnd_Dual)
        {
        return FLASH_OP_RANGE_ERROR;
        }
    }
    else 
    {
        if((StartAddr < ValidAddrStart) || (StartAddr >= ValidAddrEnd_Signal))
        {
        return FLASH_ADR_RANGE_ERROR;
        }

        if((StartAddr + Length) > ValidAddrEnd_Signal)
        {
        return FLASH_OP_RANGE_ERROR;
        }
    }

    if((StartAddr & (Size_256B-1)) || (Length & (Size_256B-1)) || (Length == 0))
    {
        return FLASH_ALIGN_ERROR;
    }

    i = Length >> 8;

    /* Authorize the FPEC of Bank1 Access */
    FLASH->KEYR = FLASH_KEY1;
    FLASH->KEYR = FLASH_KEY2;

    /* Fast program mode unlock */
    FLASH->MODEKEYR = FLASH_KEY1;
    FLASH->MODEKEYR = FLASH_KEY2;

    do{
        FLASH->CTLR |= CR_PAGE_PG;
        while(FLASH->STATR & SR_BSY)
            ;
        while(FLASH->STATR & SR_WR_BSY)
            ;
        size = 64;
        while(size)
        {
            *(uint32_t *)StartAddr = *(uint32_t *)pbuf;
            StartAddr += 4;
            pbuf += 1;
            size -= 1;
#ifdef Core_V5F
            __asm("fence");
#endif
            while(FLASH->STATR & SR_WR_BSY)
                ;
        }

        FLASH->CTLR |= CR_PG_STRT;
        while(FLASH->STATR & SR_BSY)
            ;
        FLASH->CTLR &= ~CR_PAGE_PG;
    }while(--i);

    FLASH->CTLR |= CR_FLOCK_Set;
    FLASH->CTLR |= CR_LOCK_Set;

    return status;
}

/*********************************************************************
 * @fn      FLASH_BOOT_GetMode
 *
 * @brief   Returns the BOOT mode.
 *
 * @return BOOT mode identifier.
 *          BOOT mode List-
 *  0x00FFFFFF - UART-enable USBHS-enable USBSS-enable
 *  0x06FFFFF9 - UART-enable USBHS-Disable USBSS-disable
 *  0x05FFFFFA - UART-Disable USBHS-enable USBSS-disable
 *  0x03FFFFFC - UART-Disable USBHS-disable USBSS-enable
 *  0x04FFFFFB - UART-enable USBHS-enable USBSS-disable
 *  0x01FFFFFE - UART-disable USBHS-enable USBSS-enable
 *  0x02FFFFFD - UART-enable USBHS-Disable USBSS-enable 
 */
__attribute__((optimize("O0"))) uint32_t FLASH_BOOT_GetMode( void )
{
    return( *( uint32_t * )0x08000018 );
}

